'use strict';

/*
Теоретичні питання
1. Що таке логічний оператор?

Логічні оператори, це оператори які дозволяють порівняти змінні будь-якого типу даних та виконати дії на основі результатів порівняння.

2. Які логічні оператори є в JavaScript і які їх символи?

Логічні оператори в JavaScript представлені трьома операторами - "&&" - логічне "і", "||" - логічне "або", "!" - логічне "заперечення - НЕ". Присутній четвертий оператор - "??" - оператор об'єднання з null, але останній по курсу ще не вивчали.
*/

/*
Практичні завдання.
1. Попросіть користувача ввести свій вік за допомогою prompt.
Якщо вік менше 12 років, виведіть у вікні alert повідомлення про те,
що він є дитиною, якщо вік менше 18 років, виведіть повідомлення про те,
що він є підлітком, інакше виведіть повідомлення про те, що він є дорослим.
Завдання з підвищенною складністю.
Перевірте чи ввів користувач саме число в поле prompt. Якщо ні, то виведіть повідомлення, що введено не число.
*/

const userAge = prompt('Введіть число відповідне Вашому віку');

if (+userAge > 0) {
	if (userAge < 12) {
		alert('Ви дитина');
	} else if (userAge < 18) {
		alert('Ви підліток');
	} else {
		alert('Ви доросла людина');
	}
} else {
	alert('Не вказано число, або введене не числове значення');
}



/*
2. Напишіть програму, яка запитує у користувача місяць року (українською мовою маленкими літерами) та виводить повідомлення,
скільки днів у цьому місяці. Результат виводиться в консоль.
Скільки днів в кожному місяці можна знайти тут в розділі Юліанський і Григоріанський календарі - https://uk.wikipedia.org/wiki/%D0%9C%D1%96%D1%81%D1%8F%D1%86%D1%8C_(%D1%87%D0%B0%D1%81)
(Використайте switch case)
*/

const userInput = prompt('Введіть назву місяця (українською мовою маленкими літерами)');

switch (userInput) {
	case 'січень':
	case 'березень':
	case 'травень':
	case 'липень':
	case 'серпень':
	case 'жовтень':
	case 'грудень':
		console.log('У вказаному місяці 31 день');
		break;
	case 'квітень':
	case 'червень':
	case 'вересень':
	case 'листопад':
		console.log('У вказаному місяці 30 днів');
		break;
	case 'лютий':
		console.log('У вказаному місяці 28 днів, у високосний рік 29 днів');
		break;

	default:
		console.log('Ви ввели не правильну назву місяця, або змінили регістр');
		break;
}
